OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureOTA_SPIM_Cipher/NuBL2/OTA/CommandHandler.c
/**************************************************************************//**
 * @file     CommandHandler.c
 * @version  V3.00
 * @brief    Secure ISP - Process commands
 *
 * @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <arm_cmse.h>
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "NuBL2.h"
#include "CommandHandler.h"

#define LIB_VERSION     (0x55240508UL)  // 55 + YYMMDD

#if (NVT_DCACHE_ON == 1)
// Data cache-line aligned buffer for SPIM0 data transfer with DMA mode
uint32_t g_au32ReadBuf[DCACHE_ALIGN_LINE_SIZE(SPI_FLASH_PAGE_SIZE / 4)] __ALIGNED(DCACHE_LINE_SIZE) = { 0 };
#else
// 32-byte aligned buffer for SPIM0 data transfer with DMA mode when DCache is disabled
uint32_t g_au32ReadBuf[SPI_FLASH_PAGE_SIZE / 4] __ALIGNED(32) = { 0 };
#endif

uint32_t CMDLIB_VERSION(void)
{
    return LIB_VERSION;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Miscellaneous Constant Definitions                                                                      */
/*---------------------------------------------------------------------------------------------------------*/
#define CURVE_P_SIZE        CURVE_P_256     /* ECC key length */
#define ECC_KEY_SIZE        256             /* 256-bits */
#define ALL_ONE_2KB_CHKS    0x3F55D17Ful    /* 2K all CRC32 checksum value */

void Hex2Reg(char input[], uint32_t volatile reg[]);
void Reg2Hex(int32_t count, uint32_t volatile reg[], char output[]);
uint32_t GetMaxAPROMSize(void);
int32_t _IsValidFlashRegion(uint32_t u32Addr, uint32_t u32ByteSize);

static uint8_t B2C(uint8_t c)
{
    if (c < 10)
        return (c + '0');

    if (c < 16)
        return (c - 10 + 'a');

    return 0;
}

static uint32_t Swap32(uint32_t value)
{
    volatile uint32_t val;

    /* __REV(x), byte swap32 for keil project */

    val = (value << 24) | ((value << 8) & 0xff0000) | ((value >> 8) & 0xff00) | (value >> 24);
    return val;
}

void BytesSwap(char *buf, int32_t len)
{
    int32_t i;
    char    tmp;

    for (i = 0; i < (len / 2); i++)
    {
        tmp = buf[len - i - 1];
        buf[len - i - 1] = buf[i];
        buf[i] = tmp;
    }
}

/*
    * CCITT (0xFFFF)
    * mode: 0: calculate; 1: verify
*/
static uint16_t PACKET_ExecCCITT(uint32_t *pu32buf, uint16_t len, uint8_t mode)
{
    volatile uint16_t   i;
    uint16_t            *pu16buf, OrgSum, CalSum;

    if (len > 56) // valid data byte count
        return -1;

    pu16buf = (uint16_t *)pu32buf;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_CCITT, 0, 0xFFFFul, CRC_CPU_WDATA_16);

    for (i = 1; i < (len / 2); i++)
    {
#if (0)
        printf("idx-%d: 0x%04x. (CCITT)\n", i, *(pu16buf + i));
#endif
        CRC->DAT = *(pu16buf + i);
    }

    OrgSum = *(pu16buf + 0);
    CalSum = (CRC->CHECKSUM & 0xFFFFul);

    /* Clear CRC checksum */
    CRC->SEED = 0xFFFFul;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    if (mode == 0)
    {
        *(pu16buf + 0) = CalSum;
        return CalSum;
    }
    else if (mode == 1)
    {
        NUBL_MSG("OrgSum: 0x%08X, CalSum: 0x%08X\n", OrgSum, CalSum);

        /* Verify CCITT checksum */
        if (OrgSum == CalSum)
            return 0;   /* Verify CCITT Pass */
        else
            return -1;  /* Verify CCITT Fail */
    }
    else
    {
        return -1;
    }
}

/*
    * CRC32
    * mode: 0: calculate; 1: verify
*/
static uint32_t PACKET_ExecCRC32(uint32_t *pu32buf, uint16_t len, uint8_t mode)
{
    volatile uint16_t   i;
    uint32_t            OrgSum, CalSum;

    if (len > 60) // valid data byte count
        return -1;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_32, (CRC_WDATA_RVS | CRC_CHECKSUM_COM | CRC_CHECKSUM_RVS), 0xFFFFFFFFul, CRC_CPU_WDATA_32);

    for (i = 0; i < (len / 4) - 1; i++)
    {
#if (0)
        printf("idx-%d: 0x%08x. (CRC32)\n", i, *(pu32buf + i));
#endif
        CRC->DAT = *(pu32buf + i);
    }

    OrgSum = *(pu32buf + i);
    CalSum = (CRC->CHECKSUM & 0xFFFFFFFFul);

    /* Clear CRC checksum */
    CRC->SEED = 0xFFFFFFFFul;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    if (mode == 0)
    {
        *(pu32buf + i) = CalSum;
        return CalSum;
    }
    else if (mode == 1)
    {
        /* Verify CRC32 checksum */
        if (OrgSum == CalSum)
            return 0;   /* Verify CRC32 Pass */
        else
            return -1;  /* Verify CRC32 Fail */
    }
    else
    {
        return -1;
    }
}

/**
  * @brief      Perform AES-256 CFB NoPadding encrypt
  */
static int32_t PACKET_AES256Encrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    volatile int32_t    i;

    /* KEY and IV are byte order (32 bit) reversed, Swap32(x) and stored in ISP_INFO_T */
    memcpy((void *)&CRYPTO->AES_KEY[0], KEY, (4 * 8));
    memcpy((void *)&CRYPTO->AES_IV[0], IV, (4 * 4));

    CRYPTO->AES_SADDR = (uint32_t)in;
    CRYPTO->AES_DADDR = (uint32_t)out;
    CRYPTO->AES_CNT   = len;
    CRYPTO->AES_CTL = ((AES_KEY_SIZE_256 << CRYPTO_AES_CTL_KEYSZ_Pos) | (AES_IN_OUT_SWAP << CRYPTO_AES_CTL_OUTSWAP_Pos));
    CRYPTO->AES_CTL |= (CRYPTO_AES_CTL_ENCRYPTO_Msk);
    CRYPTO->AES_CTL |= ((AES_MODE_CFB << CRYPTO_AES_CTL_OPMODE_Pos) | CRYPTO_AES_CTL_START_Msk | CRYPTO_AES_CTL_DMAEN_Msk);

    while (CRYPTO->AES_STS & CRYPTO_AES_STS_BUSY_Msk) {}

    return 0;
}

/**
  * @brief      Perform AES-256 CFB NoPadding decrypt
  */
static int32_t PACKET_AES256Decrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    volatile int32_t    i;

    /* KEY and IV are byte order (32 bit) reversed, Swap32(x) and stored in ISP_INFO_T */
    memcpy((void *)&CRYPTO->AES_KEY[0], KEY, (4 * 8));
    memcpy((void *)&CRYPTO->AES_IV[0], IV, (4 * 4));

    CRYPTO->AES_SADDR = (uint32_t)in;
    CRYPTO->AES_DADDR = (uint32_t)out;
    CRYPTO->AES_CNT   = len;
    CRYPTO->AES_CTL = ((AES_KEY_SIZE_256 << CRYPTO_AES_CTL_KEYSZ_Pos) | (AES_IN_OUT_SWAP << CRYPTO_AES_CTL_OUTSWAP_Pos));
    CRYPTO->AES_CTL |= ((AES_MODE_CFB << CRYPTO_AES_CTL_OPMODE_Pos) | CRYPTO_AES_CTL_START_Msk | CRYPTO_AES_CTL_DMAEN_Msk);

