OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureOTA_SPIM_Cipher/NuBL2/OTA/CommandHandler.c
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 0;
                    break;

                case CMD_CONNECT:
                    printf("[CMD_CONNECT] (stage 1)\n");

                    for (i = 0; i < 4; i++)
                        pISPInfo->au32AESIV[i] = Swap32(cmd.au32Data[i]);

                    for (i = 0; i < 4; i++)
                    {
                        if (pISPInfo->au32AESIV[i] != 0)
                            break;
                    }

                    if (i == 4)
                    {
                        /* NO AESIV. Client will generate a new random AES IV */
                        GenRandomIV(pISPInfo);
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.au32Data[1] = SYS->PDID;

                    for (i = 0; i < 4; i++)
                        cmd.au32Data[2 + i] = Swap32(pISPInfo->au32AESIV[i]);

                    cmd.au32Data[6] = pISPInfo->u32CmdMask;
                    cmd.au32Data[7] = 0x0;//FMC->KPKEYSTS; /* KPKEYSTS: bit-4:KEYFLAG(1:enable/0:disable), bit-3:FORBID */
                    cmd.au32Data[8] = 0x0;//(((FMC->KPKEYCNT&0xFFFF)<<16) | (FMC->KPCNT&0xFFFF));

                    DEBUG_MSG("PDID:  0x%08x.\n", cmd.au32Data[1]);

                    for (i = 0; i < 4; i++)
                        DEBUG_MSG("Target IV[%d]: 0x%08x.\n", i, pISPInfo->au32AESIV[i]);

                    cmd.u16Len      = (4 * 9);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 1;
                    break;

                default:
                    ERROR_MSG("*** [Cmd error: 0x%x] ***\n", cmd.u16CmdID);
                    cmd.au32Data[0] = ERR_CMD_INVALID;
                    cmd.u16Len      = (4 * 1);
                    ret = -1;
                    break;
            }
        }

        if (ret == -1)
            pISPInfo->IsConnectOK = 0;
    } while (0);

    CMD_GenRspPacket(&cmd, pISPInfo);

    /* Prepare respone data done */
    memcpy(pISPInfo->rspbuf, (uint8_t *)&cmd, sizeof(CMD_PACKET_T));

    DEBUG_MSG("Response.\n\n");
    return  ret;
}





static int32_t GenECDHKey(uint32_t *PrivKey, ECC_PUBKEY_T *PubKey, uint32_t *Key)
{
    volatile int32_t    ret = 0;
    char                d[70], Qx[70], Qy[70], z[70];
    uint32_t            tmp[8];

    memset(d,  0x0, sizeof(d));
    memset(Qx, 0x0, sizeof(Qx));
    memset(Qy, 0x0, sizeof(Qy));
    memset(z,  0x0, sizeof(z));

    /* Set d */
    /* B0, B1, B2 ... B31 to B31, B62, ... B0 */
    memcpy(tmp, (char *)PrivKey, sizeof(tmp));
    BytesSwap((char *)tmp, sizeof(tmp));
    Reg2Hex(64, tmp, d);
    memset(PrivKey, 0x0, (ECC_KEY_SIZE / 8));

    /* Set Qx */
    memcpy(tmp, (char *)PubKey->au32Key0, sizeof(tmp));
    BytesSwap((char *)tmp, sizeof(tmp));
    Reg2Hex(64, tmp, Qx);

    /* Set Qy */
    memcpy(tmp, (char *)PubKey->au32Key1, sizeof(tmp));
    BytesSwap((char *)tmp, sizeof(tmp));
    Reg2Hex(64, tmp, Qy);

    DEBUG_MSG("d:  %s\n", d);
    DEBUG_MSG("Qx: %s\n", Qx);
    DEBUG_MSG("Qy: %s\n", Qy);
    ret = ECC_GenerateSecretZ(CRYPTO, CURVE_P_SIZE, d, Qx, Qy, z);

    if (ret < 0)
    {
        memset(d,  0x0, sizeof(d));
        memset(Qx, 0x0, sizeof(Qx));
        memset(Qy, 0x0, sizeof(Qy));
        memset(z,  0x0, sizeof(z));
        return -1;
    }

    DEBUG_MSG("z:  %s\n", z);

    Hex2Reg(z, Key);
    BytesSwap((char *)Key, (ECC_KEY_SIZE / 8));

    memset(d,  0x0, sizeof(d));
    memset(Qx, 0x0, sizeof(Qx));
    memset(Qy, 0x0, sizeof(Qy));
    memset(z,  0x0, sizeof(z));

    DEBUG_MSG("\n");
    return 0;
}

static int32_t GenRandomPrivKey(char *d, int32_t nbits)
{
    int32_t    i, j;
    uint32_t             au32Buf[8];
    uint8_t             *pu8Buf;

    do
    {
        /* Generate random number for private key */
        if (RNG_Random(au32Buf, 8) == 0)
            return -1;

        pu8Buf = (uint8_t *)au32Buf;

        for (i = 0, j = 0; i < (nbits / 8); i++)
        {
            d[j++] = B2C(pu8Buf[i] & 0xf);
            d[j++] = B2C(pu8Buf[i] >> 4);
        }

        d[j] = 0; // NULL end

        /* Check if the private key valid */
        if (ECC_IsPrivateKeyValid(CRYPTO, CURVE_P_SIZE, d))
        {
            return 0;
        }
        else
        {
            /* Invalid key */
            ERROR_MSG("Current private key is not valid. Need a new one.\n");
            return -1;
        }
    } while (1);
}

static int32_t GenRandomECCKeyPair(uint32_t *priv, ECC_PUBKEY_T *pubkey)
{
    volatile int32_t    ret;
    char                d[70], k0[70], k1[70];

    memset(d,  0x0, sizeof(d));
    memset(k0, 0x0, sizeof(k0));
    memset(k1, 0x0, sizeof(k1));

    do
    {
        /* select random k */
        if ((ret = GenRandomPrivKey(d, ECC_KEY_SIZE)) != 0)
        {
            break;
        }

        if ((ret = ECC_GeneratePublicKey(CRYPTO, CURVE_P_SIZE, d, k0, k1)) != 0)
        {
            ERROR_MSG("\nECC key generation failed!!\n\n");
            break;
        }

        DEBUG_MSG("d:  %s\n", d);
        DEBUG_MSG("k0: %s\n", k0);
        DEBUG_MSG("k1: %s\n", k1);
        Hex2Reg(d,  priv);
        Hex2Reg(k0, pubkey->au32Key0);
        Hex2Reg(k1, pubkey->au32Key1);
        BytesSwap((char *)priv,             sizeof(pubkey->au32Key0)); // 256-bits
        BytesSwap((char *)pubkey->au32Key0, sizeof(pubkey->au32Key0));
        BytesSwap((char *)pubkey->au32Key1, sizeof(pubkey->au32Key1));
    } while (0);

    memset(d,  0x0, sizeof(d));
    memset(k0, 0x0, sizeof(k0));
    memset(k1, 0x0, sizeof(k1));

    return ret;
}

/*
    Stage 2.
    Valid commands:
        "CMD_RESYNC"             "CMD_DISCONNECT"
        "CMD_ECDH_PUB0"          "CMD_ECDH_PUB1"
        "CMD_ECDH_GET_PUB0"      "CMD_ECDH_GET_PUB1"
        "CMD_ECDH_RAND_PUB0"     "CMD_ECDH_RAND_PUB1"
        "CMD_ECDH_GET_RAND_PUB0" "CMD_ECDH_GET_RAND_PUB1"
*/
int32_t ParseECDH(ISP_INFO_T *pISPInfo)
{
    int32_t    i, ret = 0, cmd_case;
    CMD_PACKET_T        cmd;
    uint32_t            AESKey[8];
    ECC_PUBKEY_T        randpub;
    uint32_t            priv[8];

    memset(&cmd,             0x0, sizeof(CMD_PACKET_T));
    memset(pISPInfo->rspbuf, 0x0, sizeof(pISPInfo->rspbuf));

    memcpy(&cmd, pISPInfo->rcvbuf, sizeof(cmd));

    do
    {
        /* plaint text cmd */
        if (cmd.u16CmdID == CMD_RESYNC)
        {
            cmd.au32Data[0] = STS_OK;
            cmd.u16Len      = (4 * 1);
            ret = cmd.u16CmdID;
            pISPInfo->IsConnectOK = 0;
            break;
        }

        if (CMD_ParseReqPacket(&cmd, pISPInfo) != 0)
        {
            ERROR_MSG("*** [Pasre error: 0x%x] ***\n", cmd.u16CmdID);
            memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

            cmd.au32Data[0] = ERR_CMD_CHECKSUM;
            cmd.u16Len      = (4 * 1);
            ret = -1;
            break;
        }
        else
        {
            cmd_case = cmd.u16CmdID;

            switch (cmd_case)
            {
                case CMD_DISCONNECT:
                    printf("[CMD_DISCONNECT] (stage 2)\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

