OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureOTA_SPIM_Cipher/NuBL2/OTA/CommandHandler.c
                    for (i = 0; i < 8; i++)
                        AESKey[i] = Swap32(AESKey[i]);

                    memcpy(pISPInfo->tmp0, AESKey, sizeof(AESKey));

                    memcpy(pISPInfo->ClientPubKey.au32Key0, randpub.au32Key0, sizeof(randpub.au32Key0));
                    memcpy(pISPInfo->ClientPubKey.au32Key1, randpub.au32Key1, sizeof(randpub.au32Key1));
                    memset(priv, 0x0, sizeof(priv));
                    memset(&randpub, 0x0, sizeof(ECC_PUBKEY_T));

                    /* Response encrypted Client random public key 0 */
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    memcpy(&cmd.au32Data[1], pISPInfo->ClientPubKey.au32Key0, sizeof(pISPInfo->ClientPubKey.au32Key0));

                    for (i = 0; i < 8; i++)
                    {
                        DEBUG_MSG("Out rand_pub0[%d]: 0x%08x.\n", i, cmd.au32Data[1 + i]);
                    }

                    cmd.u16Len      = (4 * (1 + 8));
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_GET_RAND_PUB1: // MUST be encrypted
                    /* Response encrypted Client random public key 1 */
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    memcpy(&cmd.au32Data[1], pISPInfo->ClientPubKey.au32Key1, sizeof(pISPInfo->ClientPubKey.au32Key1));

                    for (i = 0; i < 8; i++)
                    {
                        DEBUG_MSG("Out rand_pub1[%d]: 0x%08x.\n", i, cmd.au32Data[1 + i]);
                    }

                    cmd.u16Len      = (4 * (1 + 8));
                    ret = cmd.u16CmdID;
                    break;

                default:
                    ERROR_MSG("*** [Cmd error: 0x%x] ***\n", cmd.u16CmdID);
                    cmd.au32Data[0] = ERR_CMD_INVALID;
                    cmd.u16Len      = (4 * 1);
                    ret = -1;
                    break;
            }
        }

        if (ret == -1)
            pISPInfo->IsConnectOK = 0;
    } while (0);

    CMD_GenRspPacket(&cmd, pISPInfo);

    memcpy(pISPInfo->rspbuf, (uint8_t *)&cmd, sizeof(CMD_PACKET_T));

    if ((ret == CMD_ECDH_PUB1) || (ret == CMD_ECDH_GET_RAND_PUB1))
    {
        if (ret == CMD_ECDH_PUB1)
        {
            /* Update 1st ECDH AES key to pISPInfo */
            memcpy(pISPInfo->au32AESKey, AESKey, sizeof(AESKey));

            for (i = 0; i < 8; i++)
            {
                DEBUG_MSG("Gen 1st ECDH AES KEY[%d]: 0x%08x.\n", i, pISPInfo->au32AESKey[i]);
            }
        }
        else
        {
            /* Update 2nd ECDH AES key to pISPInfo */
            memcpy(pISPInfo->au32AESKey, pISPInfo->tmp0, sizeof(AESKey));

            for (i = 0; i < 8; i++)
            {
                DEBUG_MSG("Gen 2nd ECDH AES KEY[%d]: 0x%08x.\n", i, pISPInfo->au32AESKey[i]);
            }

            memset(pISPInfo->tmp0, 0x0, sizeof(AESKey));
        }
    }

    memset(AESKey, 0x0, sizeof(AESKey));

    DEBUG_MSG("Response.\n\n");
    return ret;
}

int32_t _PageErase(uint32_t u32Addr, uint32_t count, uint32_t u32CmdMask)
{
    volatile int32_t    i, ret = -1;

    DEBUG_MSG("[Page erase] address: 0x%x, page counts: %d.\n", u32Addr, count);

    u32Addr &= ~NS_OFFSET;

    /* Check address and counts */
    if (((u32Addr % SPI_FLASH_PAGE_SIZE) != 0) || (count == 0))
        return ERR_PAGE_ALIGN;

    if (u32Addr < SPIFlash_GetFlashSize(SPIM_PORT))
    {
        if (count > (SPIFlash_GetFlashSize(SPIM_PORT) / SPI_FLASH_PAGE_SIZE))
            return ERR_OVER_RANGE;

        if ((u32Addr + (count * SPI_FLASH_PAGE_SIZE)) > SPIFlash_GetFlashSize(SPIM_PORT))
            return ERR_OVER_RANGE;
    }
    else
    {
        return ERR_OVER_RANGE;
    }

    for (i = 0; i < count; i++)
    {
        ret = ERR_ISP_ERASE;

        /* perform erase page */
        if (SPIFlash_ErasePage(SPIM_PORT, u32Addr) < 0)
            break;

        /* run 2K checksum and verify its result */
        if (GetChkSum(u32Addr, SPI_FLASH_PAGE_SIZE) != ALL_ONE_2KB_CHKS)
            break;

        u32Addr += SPI_FLASH_PAGE_SIZE;
        ret = 0;
    }

    return ret;
}

int32_t _WriteFlash(uint32_t u32Addr, uint32_t u32ByteSize, uint32_t *pu32Data, uint32_t u32CmdMask)
{
    int32_t  i, i32RetCode = -1;
    uint32_t u32StartAddr = u32Addr,
             u32Offset;

    DEBUG_MSG("[Write flash] address: 0x%x, size: %d.\n", u32StartAddr, u32ByteSize);

    if ((i32RetCode = _IsValidFlashRegion(u32StartAddr, u32ByteSize)) != 0)
        return i32RetCode;

    u32StartAddr &= ~NS_OFFSET;

    for (u32Offset = 0; u32Offset < u32ByteSize; u32Offset += SPI_FLASH_PAGE_SIZE)
    {
        DEBUG_MSG("Program offset: 0x%08X\n", u32StartAddr + u32Offset);

        /*
         *  Program data to flash block with DMA
         */
#if (NVT_DCACHE_ON == 1)
        // Clean the data cache for the buffer to ensure data consistency
        SCB_CleanDCache_by_Addr(pu32Data, u32ByteSize);
#endif

        /* write */
        SPIFlash_WritePage(SPIM_PORT, u32StartAddr + u32Offset, pu32Data, SPI_FLASH_PAGE_SIZE);

        memset(g_au32ReadBuf, 0, SPI_FLASH_PAGE_SIZE);
#if (NVT_DCACHE_ON == 1)
        // Invalidate the data cache for the buffer to ensure data consistency
        // before reading from SPI flash
        SCB_InvalidateDCache_by_Addr(g_au32ReadBuf, SPI_FLASH_PAGE_SIZE);
#endif
        /* verify */
        SPIFlash_ReadPage(SPIM_PORT, u32StartAddr + u32Offset, g_au32ReadBuf, SPI_FLASH_PAGE_SIZE);

        for (i = 0; i < (SPI_FLASH_PAGE_SIZE / 4); i++)
        {
            if (g_au32ReadBuf[i] != pu32Data[i])
            {
                ERROR_MSG("Verify 0x%08X failed ! (0x%08X != 0x%08X)\n", u32StartAddr + u32Offset + i, g_au32ReadBuf[i], pu32Data[i]);
                i32RetCode = ERR_ISP_WRITE;
                break;
            }

            i32RetCode = 0;
        }
    }

    return i32RetCode;
}

