OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureOTA_SPIM_Cipher/NuBL2/OTA/CommandHandler.c
/*
    Stage 3.
    Valid commands:
        "CMD_RESYNC"         "CMD_DISCONNECT"
        "CMD_GET_VERSION"    "CMD_RESET"
        "CMD_WRITE"          "CMD_ERASE"
        "CMD_SET_MASS_WRITE" "CMD_MASS_WRITE"
        "CMD_READ_CONFIG"    "CMD_UPDATE_CFG"
        "CMD_READ_OTP"       "CMD_WRITE_OTP" // Do NOT use "CMD_WRITE_OTP"
        "CMD_SET_REGION_LOCK"
        "CMD_XOM_SET"        "CMD_XOM_ERASE"
        "CMD_ERASE_KPROM"    "CMD_SET_KPROM"     "CMD_AUTH_KPROM"    "CMD_KPROM_STS"
        "CMD_GET_RAND_IV"    "CMD_SET_RAND_IV"   "CMD_GET_ID_SIGNATURE"
        "CMD_IDENTIFY_SERVER"
        "CMD_MASS_ERASE"
        "CMD_SET_NS"
*/
int32_t ParseCommands(ISP_INFO_T *pISPInfo)
{
    volatile int32_t    i, ret = 0, cmd_case, tmp;
    CMD_PACKET_T        cmd;
    uint32_t            addr, size;
    uint32_t            msg[8], R[8], S[8];
    ECC_PUBKEY_T        PubKey;

    memset(&cmd,             0x0, sizeof(CMD_PACKET_T));
    memset(pISPInfo->rspbuf, 0x0, sizeof(pISPInfo->rspbuf));
    memset(msg, 0x0, sizeof(msg));
    memset(R, 0x0, sizeof(R));
    memset(S, 0x0, sizeof(S));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));

    memcpy(&cmd, pISPInfo->rcvbuf, sizeof(cmd));

    do
    {
        /* plaint text cmd */
        if (cmd.u16CmdID == CMD_RESYNC)
        {
            cmd.au32Data[0] = STS_OK;
            cmd.u16Len      = (4 * 1);
            ret = cmd.u16CmdID;
            pISPInfo->IsConnectOK = 0;
            break;
        }

        if (CMD_ParseReqPacket(&cmd, pISPInfo) != 0)
        {
            ERROR_MSG("*** [Parse error: 0x%x] ***\n", cmd.u16CmdID);
            memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

            cmd.au32Data[0] = ERR_CMD_CHECKSUM;
            cmd.u16Len      = (4 * 1);
            ret = -1;
            break;
        }
        else
        {
            cmd_case = cmd.u16CmdID;

            switch (cmd_case)
            {
                case CMD_DISCONNECT:
                    printf("[CMD_DISCONNECT] (stage 3)\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 0;
                    break;

                case CMD_GET_VERSION:
                    printf("[CMD_GET_VERSION]\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.au32Data[1] = LIB_VERSION;
                    cmd.u16Len      = (4 * 2);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ERASE:
                    printf("[CMD_ERASE]\n");
                    ret = _PageErase(cmd.au32Data[0], cmd.au32Data[1], pISPInfo->u32CmdMask);
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_WRITE:
                    printf("[CMD_WRITE] (0x%x, 0x%x, 0x%x)\n", cmd.au32Data[0], cmd.au32Data[1], cmd.au32Data[2]);
                    addr = cmd.au32Data[0];
                    size = cmd.au32Data[1];
                    ret = _WriteFlash(addr, size, &cmd.au32Data[2], pISPInfo->u32CmdMask);
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_SET_MASS_WRITE:
                    printf("[CMD_SET_MASS_WRITE] (0x%x, 0x%x)\n", cmd.au32Data[0], cmd.au32Data[1]);
                    ret = _IsValidFlashRegion(cmd.au32Data[0], cmd.au32Data[1]);

                    if (ret == 0)
                    {
                        pISPInfo->tmp0[0] = cmd.au32Data[0]; // Store write address
                        pISPInfo->tmp0[1] = cmd.au32Data[1]; // Store write data length
                        FMC_DISABLE_AP_UPDATE();
                        FMC_DISABLE_LD_UPDATE();
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_MASS_WRITE:
                    printf("[CMD_MASS_WRITE]\n");
                    addr = pISPInfo->tmp0[0] + (cmd.u16PacketID * 48); // maximum data length is 48
                    size = cmd.u16Len;
                    ret = _WriteFlash(addr, size, cmd.au32Data, pISPInfo->u32CmdMask);
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_GET_ID:
                    printf("[CMD_GET_ID]\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.au32Data[1] = SYS->PDID;
                    cmd.au32Data[2] = FMC_ReadUID(0);
                    cmd.au32Data[3] = FMC_ReadUID(1);
                    cmd.au32Data[4] = FMC_ReadUID(2);
                    cmd.au32Data[5] = FMC_ReadUCID(0);
                    cmd.au32Data[6] = FMC_ReadUCID(1);
                    cmd.au32Data[7] = FMC_ReadUCID(2);
                    cmd.au32Data[8] = FMC_ReadUCID(3);
                    cmd.au32Data[9] = FMC_ReadCID();
                    cmd.au32Data[10] = 0x0ul;
                    cmd.u16Len      = (4 * 11);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_READ_CONFIG:
                    printf("[CMD_READ_CONFIG]\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

