OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureOTA_SPIM_Cipher/NuBL2/OTA/CommandHandler.c
                    cmd.au32Data[0] = STS_OK;
                    cmd.au32Data[1] = FMC_Read(FMC_CONFIG_BASE + 0x0); // CFG0
                    cmd.au32Data[2] = (uint32_t)SCU->FNSADDR;
                    cmd.au32Data[3] = 0x0ul;        //((NuBL_ISPRead(FMC_SCRLOCK_BASE) & 0xFF) << 8) | (NuBL_ISPRead(FMC_ARLOCK_BASE) & 0xFF);
                    cmd.au32Data[4] = GetMaxAPROMSize();
                    cmd.au32Data[5] = 0x0ul;        //FMC->KPKEYSTS;
                    cmd.au32Data[6] = FMC_Read(FMC_CONFIG_BASE + 0xC); // CFG3
                    cmd.au32Data[7] = FMC->XOMSTS;
                    cmd.au32Data[8] = FMC->XOMR0STS;
                    cmd.au32Data[9] = FMC->XOMR1STS;
                    cmd.au32Data[10] = FMC->XOMR2STS;
                    cmd.au32Data[11] = FMC->XOMR3STS;
                    cmd.u16Len      = (4 * 12);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_RESET:
                    printf("[CMD_RESET] (0x%x)\n", cmd.au32Data[0]);

                    if (cmd.au32Data[0] > 2)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = cmd.u16CmdID;
                        break;
                    }

                    if (cmd.au32Data[0] == 0)
                    {
                        SYS_ResetChip();
                    }
                    else if (cmd.au32Data[0] == 1)
                    {
                        NVIC_SystemReset();
                    }
                    else if (cmd.au32Data[0] == 2)
                    {
                        SYS_ResetCPU();
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_EXEC_VENDOR_FUNC:
                    printf("[CMD_EXEC_VENDOR_FUNC] (Org ID: 0x%x; Vendor ID: 0x%x)\n", cmd_case, cmd.au32Data[1]);

                    if (cmd.u16Len < 4)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = cmd.u16CmdID;
                        break;
                    }

                    if ((cmd.u16Len = pISPInfo->pfnVendorFunc((uint32_t *)&cmd, 0)) == 0)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = cmd.u16CmdID;
                        break;
                    }
                    else
                    {
                        ret = cmd.u16CmdID;
                    }

                    break;

                case CMD_IS_MASKED:
                    printf("[CMD_IS_MASKED] (0x%x)\n", cmd.u16CmdID);
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = CMD_IS_MASKED;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                default:
                    ERROR_MSG("*** [Cmd error: 0x%x] ***\n", cmd.u16CmdID);
                    cmd.au32Data[0] = ERR_CMD_INVALID;
                    cmd.u16Len      = (4 * 1);
                    ret = -1;
                    break;
            }
        }

        if (ret == -1)
            pISPInfo->IsConnectOK = 0;
    } while (0);

    memset(msg, 0x0, sizeof(msg));
    memset(R, 0x0, sizeof(R));
    memset(S, 0x0, sizeof(S));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));

    CMD_GenRspPacket(&cmd, pISPInfo);

    memcpy(pISPInfo->rspbuf, (uint8_t *)&cmd, sizeof(CMD_PACKET_T));

    if ((ret == CMD_GET_RAND_IV) || (ret == CMD_SET_RAND_IV))
    {
        /* Update AESIV to pISPInfo */
        memcpy(pISPInfo->au32AESIV, pISPInfo->tmp0, (128 / 8)); // 128-bits
    }

    DEBUG_MSG("Response.\n\n");
    return ret;
}

/*** (C) COPYRIGHT 2020 Nuvoton Technology Corp. ***/
